/**
 * @file common.h
 * @author Collinna
 * @date Февраль 2026
 * @brief Описание общих функций, определений, структур и констант игр BrickGame
 */

#pragma once

#define FIELD_WIDTH 10
///< Ширина игрового поля
#define FIELD_HEIGHT 20
///< Высота игрового поля

#define KEY_SPACE 32
///< Код пробела
#define KEY_ESC 27
///< Код не нажатой кнопки
#define DELAY 50
///< Заержка движения

#define MAX_LEVEL 10
///< Максимальный уровень игры

#define INTRO_COLS 35
///< Количество столбцов заставки
#define INTRO_ROWS 5
///< Количество строк заставки

static const int startTetrisIntro[INTRO_ROWS][INTRO_COLS] = {
    {1, 1, 1, 1, 1, 0, 2, 2, 2, 2, 2, 0, 3, 3, 3, 3, 3, 0,
     4, 4, 4, 4, 0, 0, 5, 0, 0, 0, 5, 0, 0, 6, 6, 6, 0},
    {0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0,
     4, 0, 0, 0, 4, 0, 5, 0, 0, 5, 5, 0, 6, 0, 0, 0, 6},
    {0, 0, 1, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 3, 0, 0, 0,
     4, 0, 0, 0, 4, 0, 5, 0, 5, 0, 5, 0, 6, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0,
     4, 4, 4, 4, 0, 0, 5, 5, 0, 0, 5, 0, 6, 0, 0, 0, 6},
    {0, 0, 1, 0, 0, 0, 2, 2, 2, 2, 2, 0, 0, 0, 3, 0, 0, 0,
     4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 0, 0, 6, 6, 6, 0}};

static const int startSnakeIntro[INTRO_ROWS][INTRO_COLS] = {
    {1, 1, 1, 1, 0, 0, 2, 0, 0, 0, 2, 0, 3, 3, 3, 3, 3, 0,
     4, 0, 4, 0, 4, 0, 5, 0, 0, 0, 5, 0, 0, 6, 6, 6, 6},
    {0, 0, 0, 0, 1, 0, 2, 2, 0, 2, 2, 0, 3, 0, 0, 0, 0, 0,
     4, 0, 0, 4, 4, 0, 5, 0, 0, 5, 0, 0, 6, 0, 0, 0, 6},
    {0, 1, 1, 1, 0, 0, 2, 0, 2, 0, 2, 0, 3, 3, 3, 3, 0, 0,
     4, 0, 4, 0, 4, 0, 5, 5, 5, 0, 0, 0, 6, 6, 6, 6, 6},
    {0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 2, 0, 3, 0, 0, 0, 0, 0,
     4, 4, 0, 0, 4, 0, 5, 0, 0, 5, 0, 0, 6, 0, 0, 0, 6},
    {1, 1, 1, 1, 0, 0, 2, 0, 0, 0, 2, 0, 3, 3, 3, 3, 3, 0,
     4, 0, 0, 0, 4, 0, 5, 0, 0, 0, 5, 0, 6, 0, 0, 0, 6}};

static const int winIntro[INTRO_ROWS][INTRO_COLS] = {
    {1, 1, 1, 1, 1, 0, 0, 2, 2, 2, 0, 0, 3, 3, 3, 3, 3, 0,
     4, 4, 4, 4, 4, 0, 5, 5, 5, 5, 0, 0, 0, 6, 6, 6, 6},
    {1, 0, 0, 0, 1, 0, 2, 0, 0, 0, 2, 0, 3, 0, 0, 0, 0, 0,
     4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 0, 6, 0, 0, 0, 6},
    {1, 0, 0, 0, 1, 0, 2, 0, 0, 0, 2, 0, 3, 3, 3, 3, 0, 0,
     4, 4, 4, 4, 0, 0, 5, 0, 0, 0, 5, 0, 6, 6, 6, 6, 6},
    {1, 0, 0, 0, 1, 0, 2, 0, 0, 0, 2, 0, 3, 0, 0, 0, 3, 0,
     4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 0, 6, 0, 0, 0, 6},
    {1, 0, 0, 0, 1, 0, 0, 2, 2, 2, 0, 0, 3, 3, 3, 3, 0, 0,
     4, 4, 4, 4, 4, 0, 5, 5, 5, 5, 5, 0, 6, 0, 0, 0, 6}};

static const int finishIntro[INTRO_ROWS][INTRO_COLS] = {
    {0, 0, 1, 0, 0, 0, 1, 0, 0, 2, 2, 2, 0, 0, 3, 0, 0, 0,
     3, 0, 4, 4, 4, 4, 4, 0, 5, 0, 0, 0, 5, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 1, 0, 0, 2, 0, 0, 0, 2, 0, 3, 0, 0, 0,
     3, 0, 4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 0, 0, 0, 0},
    {0, 0, 1, 1, 1, 0, 0, 0, 2, 0, 0, 0, 2, 0, 3, 3, 3, 3,
     3, 0, 4, 4, 4, 0, 0, 0, 5, 0, 0, 0, 5, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 1, 0, 0, 2, 0, 0, 0, 2, 0, 3, 0, 0, 0,
     3, 0, 4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 0, 1, 0, 0, 2, 2, 2, 0, 0, 3, 0, 0, 0,
     3, 0, 4, 4, 4, 4, 4, 0, 5, 5, 5, 5, 5, 5, 0, 0, 0}};

/*! \struct GameInfo_t
 * Текущее состояние игрового поля
 */
typedef struct {
  int **field;
  ///< Указатель на игровое поле
  int **next;
  ///< Указатель на следующее тетрамино
  int score;
  ///< Заработанные очки
  int high_score;
  ///< Рекорд
  int level;
  ///< Текущий уровень игры
  int speed;
  ///< Текущая скорость игры
  int pause;
  ///< Флаг паузы
} GameInfo_t;

/** Перечисление действий игрока */
typedef enum {
  Start,
  /**< Действие старт игры */
  Pause,
  /**< Действие паузы игры */
  Terminate,
  /**< Действие завершение игры */
  Left,
  /**< Действие влево */
  Right,
  /**< Действие вправо */
  Up,
  /**< Действие вверх (не используется) */
  Down,
  /**< Действие вниз (ускорение падения) */
  Action,
  /**< Действие вращение */
  Default
  /**< Без действие> */
} UserAction_t;

/** Перечисление состояний игры */
typedef enum {
  Initial = 0,
  ///< Состояние инициализации игры
  StartState,
  ///< Состояние старта игры
  Spawn,
  ///< Состояние создания нового тетромино
  Moving,
  ///< Состояние движения тетромино
  Shifting,
  ///< Состояние смещения тетромино вниз
  Drop,
  ///< Состояние ускорения падения
  Attaching,
  ///< Состояние приземления тетромино
  Gameover,
  ///< Состояние окончания игры
  PauseState
  ///< Состояние паузы игры
} State_t;

/*! \fn int s21_updateHighScore(int highScore, int score);
 * \brief Обновление рекорда (максимального счета игры)
 * \param highScore Текущий рекорд
 * \param score Текущий счет
 * \return Новый рекорд
 */
int s21_updateHighScore(int highScore, int score);

/*! \fn s21_updateLevel(int score, int scoreToLevelUp)
 * \brief Обновление уровня игры в зависимости от счета игры
 * \param score Текущий счет
 * \param scoreToLevelUp Количество очков для повышения уровня
 * \return Новый уровень игры
 */
int s21_updateLevel(int score, int scoreToLevelUp);

/*! \fn long long int s21_getTime()
 * \brief Получение текущего времени
 * \return Количество миллисекунд от начала отсчёта 01.01.1970
 */
long long int s21_getTime();

/*! \fn void s21_readHighScore(const char *fn)
 * \brief Чтение из файла рекорда игры
 * \param fn Имя файла для чтения
 * \return Рекорд игры
 */
int s21_readHighScore(const char *fn);

/*! \fn void s21_writeHighScore(int high_score, const char *fn)
 * \brief Запись в файл рекорда игры
 * \param high_score Рекорд игры
 * \param fn Имя файла для записи
 */
void s21_writeHighScore(int high_score, const char *fn);

/*! \fn GameInfo_t updateCurrentState()
 * \brief Получение данных для отрисовки в интерфейсе
 */
GameInfo_t updateCurrentState();

/*! \fn UserAction_t s21_getAction(int key)
 * \brief Преобразование кода нажатой клавиши в Действие
 * \param key Код нажатой клавиши
 * \return Текущее действие
 */
UserAction_t s21_getAction(int key);

/*! \fn void userInput(UserAction_t action, bool hold)
 * \brief Обработка действия пользователя
 * \param action Дейстие пользователя
 * \param hold Флаг зажатия клавиши
 */
void userInput(UserAction_t action, bool hold);
